#include<iostream>

//基本数据类型定义出来的叫变量
//复活数据类型定义出来的叫对象
struct _ABC
{
	char a;
	short b;
	int c;
};

void main()
{
	_ABC a = {1,2,3},b = {4,5,6};
	a = b;//赋值√
	//a + b;//算术×
	//a - b;
	//a * b;
	//a / b;
	sizeof(_ABC);//取字节√
	//++a;//自增自减×
	//a++;
	//a && b;逻辑×
	//a == b;关系×
	//a ? 1:2;//条件放在?左边×
	1 ? a:b;//条件放在?右边√
	//a & b;//位×
	//a += b;//自赋值×
	_ABC c[3];
	c[0].a = c[0].b = c[0].c = 1;//下标√
	_ABC* d = &a;//取地址√
	(*d) = b;//解引用√
	a.a = 1;//对象引出(结构体专用)
	d->a = 1;//地址引用(结构体专用)

	system("pause");
}
