#include <iostream>

//数据类型
//基本数据类型
//复合数据类型(结构体，枚举等)
//指针
//引用

//基本数据类型

void main()
{
	//bool //布尔型. 在内存中占1个字节，其取值为0和1
	//false(0 假)，true（1 真）
	//bool a;
	//a = true;
	//a = false;
	
	//字符
	//char 字符型 在内存中占1个字节 取值范围 -128到127
	//unsigned char 无符号字符型 在内存中占1个字节， 取值范围 0到255
	//wchar_t 宽(双)字节字符型 在内存中占2个字节 取值范围 0到65535

	//short 短整型 在内存中占2个字节 取值范围-32768到32767
	//unsinged short 无符号短整型 在内存中占2个字节 取值范围0到65535
	//int 整型 在内存中占4个字节 
	//unsinged int 无符号整型 在内存中占4个字节
	//long 长整型 在内存中占4个字节
	//unsinged long 无符号长整型 在内存中占4个字节

	//float 单精度浮点型 在内存中占4个字节
	//double 双精度浮点型 在内存中占8个字节
	//long double 长双精度浮点型 在内存中占8个字节


	system("pause");
}