#include<iostream>

//此处定义了一个结构体类型名叫_ABC。此后的代码
//中就可以把_ABC当做一个类型来使用
struct _ABC
{
	char u;
	short i;
	int o;
};//u,i,o称为_ABC类型的成员变量


void main()
{
	_ABC a1;
	a1.u = 1;
	a1.i = 2;
	a1.o = 3;
	(&a1)->u = 4;
	(&a1)->i = 5;
	(&a1)->o = 6;

	_ABC* a2 = &a1;
	a2->u = 7;
	a2->i = 8;
	a2->o = 9;
	
	char x[10] = {};//00 00 00 00 00 00 00 00 00 00

	int* p = (int*)x;
	*p = 1; //01 00 00 00 00 00 00 00 00 00
	_ABC* q = (_ABC*)x;
	q->u = 4;//04 00 00 00 00 00 00 00 00 00
	q->i = 5;//04 00 05 00 00 00 00 00 00 00
	q->o = 6;//04 00 05 00 06 00 00 00 00 00
	(q + 1)->u = 7;//04 00 05 00 06 00 00 00  07 00
	
	//q[1].u = 7;//和上面的完全一样
	//(q + 1)->i = 8;//越界
	system("pause");
}
