#include<iostream>

void main()
{
	bool a = true;//01
	short b = 12345;//39 30
	int c = 123456789;//15 cd 5b 07
	char d[7] = {};//00 00 00 00 00 00 00
	
	//将d这个char地址强制转换为bool地址在初始化bool指针e
	bool* e = (bool*)d;

	*d = 'a';//61 00 00 00 00 00 00
	
	*e = a;//01 00 00 00 00 00 00

	short* f = (short*)d + 1;//先转换为short地址后再加1

	*f = 12345;//01 00 39 30 00 00 00

	f = (short*)(e + 1);//先将e的地址加1，然后强制转换为short地址

	*f = b;//12345 //01 39 30 30 00 00 00

	*((int*)(d + 3)) = c;//01 39 30 15 cd 5b 07

	//无论怎么强制转换，d仍然是char地址
	//(Y类型*)(X类型地址)的结果是一个Y类型的地址，
	//其字节编号和()中的X类型地址的字节编号相同
	system("pause");
}