#include<iostream>

void main()
{
	int a = 0;//00 00 00 00

	*((bool*)&a) = true;//01 00 00 00
	*((char*)&a + 1) = 'a';//01 61 00 00
	//((char*)&a)[1] = 'a';

	*((short*)&a + 1) = 12345;//01 61 39 30

	a = 0;//00 00 00 00
	*((short*)((char*)&a + 1)) = 12345;//00 39 30 00
	
	//超出了一个字节,越界了
	//*((short*)((char*)&a + 3)) = 12345;

	*((bool*)((char*)&a + 3)) = true;//00 39 30 01

	a = 0;//00 00 00 00
	((char*)(&((short*)&a)[1]))[0] = 1;
	//00 00 01 00

	int b = 0x61626364;//64 63 62 61
	std::cout<<(char*)&b<<std::endl;
	
	//0x0012FF40 
	char c[8] = {};//00 00 00 00 00 00 00 00
	//指针
	//对c进行强制转换为int*类型的地址，在对其解
	//引用，解出来后就是int指针
	//*((int**)c)

	//先在c地址上加2后再强制转换为int地址
	//(int*)(c + 2) //0x0012FF42
	*((int**)c) = (int*)(c + 2);//42 ff 12 00 00 00 00 00
 
	system("pause");
}