#include <iostream>

void main()
{
	//内存：在内存中开辟了sizeof(int) * 2 * 3共24个字节
	//的连续内存块，该内存块的首地址命名a
	//语言：
	//定义了一个一维长度为2，二维长度为3的二维数组a，
	//它包含了6个int型的变量,分别为a[0][0],a[0][1],
	//a[0][2],a[1][0],a[1][1],a[1][2],[]中的整数就是下标
	//下标访问范围是0到该下标所属的维度的长度-1；
	int a[2][3];

	a[0][0] = 1;
	a[0][1] = 2;
	a[0][2] = 3;
	a[1][0] = 4;
	a[1][1] = 5;
	a[1][2] = 6;

	int b[6] = {1,2,3};
	std::cout<<b<<std::endl;

	//a是一个二级地址
	//a[0],a[1]是一个一级地址
	//b是一个一级地址
	std::cout<<a<<std::endl;

	std::cout<<a[0]<<std::endl;

	std::cout<<a[1]<<std::endl;

	std::cout<<a[0][0]<<std::endl;
	//二维数组是通过两个下标去索引一个变量，
	//一般来说，我们还是用一维数组来做地图
	
	system("pause");
}