#include<iostream>

//此处定义了一个结构体类型名叫_ABC。此后的代码
//中就可以把_ABC当做一个类型来使用
struct _ABC
{
	char u;
	short i;
	int o;
};//u,i,o称为_ABC类型的成员变量


void main()
{
	_ABC a1;//定义单个对象
	a1.u = 1;
	a1.i = 2;
	a1.o = 3;

	_ABC a2[3];//定义数组
	a2[1].u = 4;
	a2[1].i = 5;
	a2[1].o = 6;

	_ABC* a3 = a2;//定义指针
	a3[2].u = 7;
	a3[2].i = 8;
	a3[2].o = 9;//对象引出：结构体变量.成员变量
	a3->u = 10;
	a3->i = 11;
	a3->o = 12;//地址引出：结构体地址->成员变量
	//结构体变量.成员变量 结构体地址->成员变量
	//的结构都是那个成员变量
	
	_ABC& a4 = a1;//定义并初始化引用

	a4.u = 13;
	a4.i = 14;
	a4.o = 15;

	system("pause");
}
