#include<iostream>

void main()
{
	int a = 0;//11223344
	*((bool*)&a) = true;//01 00 00 00
	*((char*)&a + 1) = 'a';//01 61 00 00
	//((char*)&a)[1] = 'a';//效果和上面一样
	*((short*)&a + 1) = 12345;//01 61 39 30
	a = 0;//00 00 00 00
	*((short*)((char*)&a + 1)) = 12345;
	//00 39 30 00
	//越界多了一个字节
	//*((short*)((char*)&a + 3)) = 12345;
	*((bool*)((char*)&a + 3)) = true;
	//00 39 30 01

	a = 0;//00 00 00 00
	((char*)(&((short*)&a)[1]))[0] = 1;//00 00 31 00

	int b = 0x61626364;//64 63 62 61 
	std::cout<<(char*)&b<<std::endl;
	//c的地址0x0012FF40
	char c[8] = {};//00 00 00 00 00 00 00 00
	//指针 c[2]地址
	*((int**)c) = (int*)(c + 2);//42 ff 12 00 00 00 00 00

	system("pause");
}